docs/diagrams/AR.md
```mermaid
%%{ init: { 'flowchart': {'defaultRenderer': 'elk' } } }%%
flowchart TD
  %% Nodi principali
  PresaInCarico["Materialità presa in carico ed accettata dal recapitista"] -->|RECRN001A| ConsegnatoPreEsito["Consegnato<br>(pre-esito)"]
  PresaInCarico -->|RECRN002A| MancataConsegnaPreEsito["Mancata consegna<br>(pre-esito)"]
  PresaInCarico -->|RECRN002D| IrreperibilitaAssolutaPreEsito["Irreperibilita assoluta<br>(pre-esito)"]
  PresaInCarico -->|RECRN006| FurtoSmarrimentoDeterioramento["Furto<br>Smarrimento<br>Deterioramento"]
  PresaInCarico -->|RECRN010| Inesito["Inesito"]

  %% Consegnato
  ConsegnatoPreEsito -->| RECRN001B<br>Demat AR| ConsegnatoDemat["Consegnato (demat)"]
  ConsegnatoDemat -->|RECRN001C| ConsegnatoFascicoloChiuso["Consegnato (fascicolo chiuso)"]

  %% Mancata consegna
  MancataConsegnaPreEsito -->|RECRN002B<br>Demat Plico| MancataConsegnaDemat["Mancata consegna (demat)"]
  MancataConsegnaDemat -->|RECRN002C| MancataConsegnaFascicoloChiuso["Mancata consegna (fascicolo chiuso)"]

  %% Irreperibilita assoluta
  IrreperibilitaAssolutaPreEsito -->|RECRN002E<br>Demat Plico<br>Demat Indagine| IrreperibilitaAssolutaDemat["Irreperibilita assoluta (demat)"]
  IrreperibilitaAssolutaDemat -->|RECRN002E<br>Demat Plico<br>Demat Indagine| IrreperibilitaAssolutaDemat
  IrreperibilitaAssolutaDemat -->|RECRN002F| IrreperibilitaAssolutaFascicoloChiuso["Irreperibilita assoluta (fascicolo chiuso)"]

  %% Giacenza
  Inesito -->|RECRN006| FurtoSmarrimentoDeterioramento
  Inesito -->|RECRN011| InGiacenza["In giacenza"]

  %% Consegnato presso giacenza
  InGiacenza -->|RECRN003A| ConsegnatoPressoGiacenzaPreEsito["Consegnato presso giacenza (pre-esito)"]
  ConsegnatoPressoGiacenzaPreEsito -->|RECRN003B<br>Demat AR| ConsegnatoPressoGiacenzaDemat["Consegnato presso giacenza (demat)"]
  ConsegnatoPressoGiacenzaDemat --> ConsegnatoPressoGiacenzaFascicoloChiuso["Consegnato presso giacenza (fascicolo chiuso)"]

  %% Mancata consegna presso giacenza
  InGiacenza -->|RECRN004A| MancataConsegnaPressoGiacenzaPreEsito["Mancata consegna presso giacenza (pre-esito)"]
  MancataConsegnaPressoGiacenzaPreEsito -->|RECRN004B<br>Demat Plico| MancataConsegnaPressoGiacenzaDemat["Mancata consegna presso giacenza (demat)"]
  MancataConsegnaPressoGiacenzaDemat --> MancataConsegnaPressoGiacenzaFascicoloChiuso["Mancata consegna presso giacenza (fascicolo chiuso)"]

  %% Compiuta giacenza presso giacenza
  InGiacenza -->|RECRN005A| CompiutaGiacenzaPressoGiacenzaPreEsito["Compiuta giacenza presso giacenza (pre-esito)"]
  CompiutaGiacenzaPressoGiacenzaPreEsito -->|RECRN005B<br>Demat Plico| CompiutaGiacenzaPressoGiacenzaDemat["Compiuta giacenza presso giacenza (demat)"]
  CompiutaGiacenzaPressoGiacenzaDemat --> CompiutaGiacenzaPressoGiacenzaFascicoloChiuso["Compiuta giacenza presso giacenza (fascicolo chiuso)"]

  %% Stili
  style FurtoSmarrimentoDeterioramento fill:#43A047
  style ConsegnatoFascicoloChiuso fill:#43A047
  style IrreperibilitaAssolutaFascicoloChiuso fill:#43A047
  style ConsegnatoPressoGiacenzaFascicoloChiuso fill:#43A047
  style MancataConsegnaPressoGiacenzaFascicoloChiuso fill:#43A047
  style CompiutaGiacenzaPressoGiacenzaFascicoloChiuso fill:#43A047
  style MancataConsegnaFascicoloChiuso fill:#43A047
```
